"""
Давайте передохнём от автоматизации и сделаем что-то действительно интересное.

Формат ввода
Одно натуральное число N

Формат вывода
N строк с фразой: "Купи слона!"
"""

print(int(input()) * f"Купи слона!\n")
